app/controllers/carts_controller.rb

  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 3]]