app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @line_item = LineItem.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY name LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 03 Dec 2012 16:34:44 UTC +00:00], ["updated_at", Mon, 03 Dec 2012 16:34:44 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 4], ["created_at", Wed, 05 Dec 2012 16:40:18 UTC +00:00], ["product_id", 2], ["quantity", 1], ["updated_at", Wed, 05 Dec 2012 16:40:18 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 3, "updated_at" = '2012-12-05 15:10:04.678221' WHERE "line_items"."id" = 6
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    # @line_item = @cart.line_items.build(:product => product)
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "17"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 17]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 5
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy

    respond_to do |format|
      # format.html { redirect_to line_items_url }
      if current_cart.line_items.empty?