app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY name

  def show
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY name LIMIT 1  [["id", "1"]]

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY name LIMIT 1  [["id", "1"]]

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("brief_description", "created_at", "full_description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "meta_keywords", "name", "price", "sku", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY name LIMIT 1  [["id", "1"]]
UPDATE "products" SET "image_file_name" = 'bubble.jpg', "image_content_type" = 'image/jpeg', "image_file_size" = 191955, "image_updated_at" = '2012-11-28 16:39:16.718455', "updated_at" = '2012-11-28 16:39:16.969741' WHERE "products"."id" = 1

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY name LIMIT 1  [["id", "1"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]